Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: Manually extracting the files to a different directory may help.
pt_br: Extrair manualmente os arquivos para um diretório diferente pode ajudar.

source: Meaning the stuff inside can be left out if you don't need them.
pt_br: O que significa que as coisas dentro dos colchetes podem ser omitidas se você não precisar delas.

source: Meaning, you do not wrap Ctrl or Enter (or any other key) inside curly brackets when making a hotkey.
pt_br: Significa que você não envolve Ctrl ou Enter (ou qualquer outra tecla) dentro de {chaves} ao criar uma hotkey.

source: Medium (default)
pt_br: Média (padrão)

source: Method 1:
pt_br: Método 1:

source: Method 2:
pt_br: Método 2:

source: Methods
pt_br: Métodos

source: Middle or wheel mouse button
pt_br: Botão da roda ou botão intermediário do mouse

source: Middle-click to copy the link address.":true,
pt_br: Middle-click to copy the link address.":"Abra este documento no navegador padrão (requer conexão com a internet). Clique com o botão do meio do mouse para copiar o endereço do link.",

source: Minimizing the main window causes it to automatically be hidden.
pt_br: Minimizar a janela principal faz com que ela seja automaticamente oculta.

source: Miscellaneous topics
pt_br: Tópicos diversos

source: Modifier Keys
pt_br: Teclas Modificadoras

source: Modifier keys are restored differently to allow a Send to turn off a hotkey's modifiers even if the user is still physically holding them down.
pt_br: Teclas modificadoras são restauradas de maneira diferente para permitir que o comando Send desabilite os modificadores de uma hotkey mesmo se o usuário ainda está fisicamente mantendo as teclas pressionadas.

source: Modular code is usually easier to test, understand and maintain.
pt_br: Código modular é geralmente mais fácil de testar, entender e manter.

source: More DirectX issues may occur when using PixelSearch, PixelGetColor or ImageSearch.
pt_br: Pode ocorrer outros problemas com o DirectX ao se usar PixelSearch, PixelGetColor ou ImageSearch.

source: Most scripts have an effect only while they are running.
pt_br: A maioria dos scripts tem efeito somente enquanto estiverem em execução.

source: MsgBox The page is done loading.
pt_br: MsgBox A página terminou de carregar.

source: MsgBox The wait timed out or the window was closed.
pt_br: MsgBox A espera se esgotou ou a janela foi fechada.

source: MsgBox double-press
pt_br: MsgBox pressione duas vezes

source: MsgBox, %A_ThisHotkey% was pressed.
pt_br: MsgBox, %A_ThisHotkey% foi pressionada.

source: MsgBox, %OutputVar%`, That makes me sad.
pt_br: MsgBox, %OutputVar%`, isso me deixa triste.

source: MsgBox, Be careful!
pt_br: MsgBox, Tome cuidado!

source: MsgBox, Content of the edit control:
pt_br: MsgBox, Conteúdo do controle 'edit':

source: MsgBox, MyVar equals %MyVar%!!
pt_br: MsgBox, MinhaVariavel é igual a %MinhaVariavel%!!

source: MsgBox, My`, what a shiny new vehicle you have there.
pt_br: MsgBox, Meu`, que possante brilhoso é esse seu novo carro.

source: MsgBox, Thank you for answering %OutputVar2%`, %OutputVar%!
pt_br: MsgBox, Obrigado por responder %OutputVar2%`, %OutputVar%!

source: MsgBox, That's an awesome name`, %OutputVar%.
pt_br: MsgBox, Esse é um nome maravilhoso`, %OutputVar%.

source: MsgBox, The car is really old.
pt_br: MsgBox, O carro está bem velho.

source: MsgBox, There are
pt_br: MsgBox, Aqui tem

source: MsgBox, This car is not safe to drive.
pt_br: MsgBox, Este carro não está seguro para dirigir.

source: MsgBox, This is some text.
pt_br: MsgBox, Este é um texto.

source: MsgBox, We are now 'outside' of the if-statement.
pt_br: MsgBox, Agora estamos 'fora' da instrução com If.

source: MsgBox, Wow!
pt_br: MsgBox, Uau!

source: MsgBox, You pressed ALT+Q in Notepad.
pt_br: MsgBox, Você pressionou Alt+Q dentro do Bloco de Notas.

source: MsgBox, You pressed ALT+Q in any window.
pt_br: MsgBox, Você pressionou Alt+Q em alguma outra janela.

source: MsgBox, You pressed Numpad1 while holding down Numpad0.
pt_br: MsgBox, Você pressionou Numpad1 enquanto segurava Numpad0.

source: MsgBox, You pressed WIN+SPACE in MSPaint!
pt_br: MsgBox, Você pressionou Win+Espaço no Paint!

source: MsgBox, You pressed WIN+SPACE in Notepad.
pt_br: MsgBox, Você pressionou Win+Espaço no Bloco de Notas.

source: MsgBox, You pressed YES.
pt_br: MsgBox, Você pressionou SIM.

source: MsgBox, You typed btw.
pt_br: MsgBox, Você digitou "tdb".

source: Multimedia Keys
pt_br: Teclas de Multimídia

source: Multiple hotkeys, multiple hotstrings.
pt_br: Múltiplas hotkeys, múltiplas hotstrings.

source: Multiple hotkeys/hotstrings per file
pt_br: Múltiplas hotkeys e hotstrings num mesmo arquivo

source: Mute the volume
pt_br: Mutar o volume

source: My antivirus program flagged AHK as malware.
pt_br: Meu antivírus está dizendo que o AHK é malware.

source: My antivirus program flagged AutoHotkey or a compiled script as malware.
pt_br: Meu programa antivírus acusou o AutoHotkey ou um script compilado de ser malware.

source: My keypad has a special 000 key.
pt_br: Meu teclado numérico tem a tecla especial 000.

source: MyObject := Array("one", "two", "three", 17)
pt_br: MeuObjeto := Array("um", "dois", "tres", 17)

source: MyObject := ["one", "two", "three", 17]
pt_br: MeuObjeto := ["um", "dois", "três", 17]

source: MyObject.InsertAt(Index, Value1, Value2, Value3...)
pt_br: MeuObjeto.InsertAt(Indice, Valor1, Valor2, Valor3...)

source: MyObject.NewKey := "Shiny"
pt_br: MeuObjeto.NovaChave := "Brilhante"

source: MyObject.Pop()
pt_br: MeuObjeto.Pop()

source: MyObject.Push(Value1, Value2, Value3...)
pt_br: MeuObjeto.Push(Valor1, Valor2, Valor3...)

source: MyObject["NewerKey"] := 3.1415
pt_br: MeuObjeto["NovaChave"] := 3.1415

source: MyScript.ahk
pt_br: MeuScript.ahk

source: MyVar := "Text"
pt_br: MyVar := "Texto"

source: MyVar := "The value of 5 + " MyVar2 " is:
pt_br: MinhaVar := "O valor de 5 + " MinhaVar2 " é:

source: MyVar := 6 + 8 / 3 * 2 - Sqrt(9)
pt_br: MinhaVar := 6 + 8 / 3 * 2 - Sqrt(9)

source: MyVar := MyVar2
pt_br: MinhaVar := MinhaVar2

source: MyVar = %MyVar2%
pt_br: MinhaVar = %MinhaVar2%

source: MyVar = %MyVar2% some text %MyVar3%.
pt_br: MinhaVar = %MinhaVar2% algum texto %MinhaVar3%

source: MyVar = Text
pt_br: MinhaVar = Texto

source: NOTE:
pt_br: OBSERVAÇÃO:

source: Name
pt_br: Nome

source: Names
pt_br: Nomes

source: New scripts should use {0} instead.":true
pt_br: New scripts should use {0} instead.":"Obsoleto. Novos scripts devem usar {0} em seu lugar."

source: Next Track
pt_br: Próxima faixa

source: Normally if AutoHotkey is installed, right-clicking an AutoHotkey script (.ahk) file should give the following options:
pt_br: Normalmente se o AutoHotkey está instalado, clicar com o botão direito num script do AutoHotkey (arquivo .ahk) deve apresentar as opções a seguir:

source: Normally statements are executed sequentially from top to bottom, but a control flow statement can override this, such as by specifying that statements should be executed repeatedly, or only if a certain condition is met.
pt_br: Normalmente as instruções são executadas sequencialmente de cima para baixo, mas uma instrução de controle de fluxo pode ignorar essa ordem (tomar precedência), tal como quando se especifica que as instruções devem ser executadas repetidamente, ou somente se determinada condição for atingida.

source: Not all games allow AHK to send keys and clicks or receive pixel colors.
pt_br: Nem todos os jogos permitem que o AHK envie pressionamentos de teclas ou cliques ou receba cores de píxeis.

source: Not indented:
pt_br: Não indentado:

source: Not only is bypassing these systems in violation of the games policies and could get you banned, they are complex to work around.
pt_br: Contornar essas proteções violando os termos de uso do jogo podem fazer que você seja banido; além disso, são sistemas de proteção complexos.

source: Note that hotkey prefix symbols such as ^ (control) and + (shift) are not supported (though GetKeyState() can be used as a substitute).
pt_br: Note que símbolos de prefixos de hotkeys como ^ (control) e + (shift) não são suportados (apesar de GetKeyState() poder ser usada como substituta).

source: Note that INI files accessed with the standard INI commands do not support UTF-8; they must be saved as ANSI or UTF-16.
pt_br: Note que arquivos INÍCIO acessados com os comandos INI padrão não suportam UTF-8; eles devem ser salvos como ANSI ou UTF-16.

source: Note that depending on your system settings the ".ahk" part may be hidden, but the file should have an icon like
pt_br: Note que, dependendo das configurações do seu sistema, a parte ".ahk" pode estar oculta, mas o arquivo deverá ter um ícone como

source: Note that the sleep key on some keyboards might not work with this.
pt_br: Note que, em alguns teclados, a tecla Adormecer pode não funcionar com este termo “Sleep”.

source: Note that this also causes any programs launched by the script to run as administrator, and may require the user to accept an approval prompt when launching the script.
pt_br: Note que isso faz com que quaisquer programas abertos pelo script também rodem como administrador, e podem exigir que o usuário aceite um prompt de aprovação ao executar o script.

source: Note that when you compile a script that uses auto-included function libraries, AutoHotkey.exe and the Lib folder must be up one level from Ahk2Exe.exe (e.g. \AutoHotkey.exe vs \Compiler\Ahk2Exe.exe).
pt_br: Observe que quando você compila um script que usa bibliotecas de função incluídas automaticamente, AutoHotkey.exe e a pasta da biblioteca devem estar um nível acima do arquivo Ahk2Exe.exe (ex: \AutoHotkey.exe x \Compiler\Ahk2Exe.exe).

source: Nothing
pt_br: “Nada”

source: Notice that if name is present, it becomes the first parameter.
pt_br: Note que se name estiver presente, ele se torna o primeiro parâmetro.

source: Now, to make Numpad0 send a real Numpad0 keystroke whenever it wasn't used to launch a hotkey such as the above, add the following hotkey:
pt_br: Agora, para fazer com que a tecla Numpad0 envie um pressionamento real de Numpad0 toda vez que ela não tiver sido usada como uma hotkey como no caso acima, adicione a hotkey a seguir:

source: Number := 6
pt_br: Numero := 6

source: NumberOfRemovedKeys := MyObject.Delete(FirstKey, LastKey)
pt_br: NumeroDeChavesDeletadas := MeuObjeto.Delete(PrimeiraChave, UltimaChave)

source: NumberOfRemovedKeys := MyObject.RemoveAt(Index, Length)
pt_br: NumeroDeChavesRemovidas := MeuObjeto.RemoveAt(Indice, Comprimento)

source: Numbers
pt_br: Números

source: Numbers written with a decimal point are always considered to be floating-point, even if the fractional part is zero.
pt_br: Números escritos com uma casa decimal são sempre considerados como ponto flutuante, mesmo quando a parte fracionária é zero.

source: Numpad Keys
pt_br: Teclas do Teclado Numérico

source: Numpad0 & Numpad1::MsgBox, You pressed Numpad1 while holding down Numpad0.
pt_br: Numpad0 & Numpad1::MsgBox, Você pressionou Numpad1 enquanto segurava Numpad0.

source: Object Protocol
pt_br: Protocolo dos Objetos

source: Object function
pt_br: Função-objeto

source: Objects
pt_br: Objetos

source: Objects can be used to build complex structures by combining them with other objects.
pt_br: Objetos podem ser usados para montar estruturas complexas combinando-se-os com outros objetos.

source: Objects don't have the capability to store both a number and a string as a key or value.
pt_br: Objetos não têm a capacidade de armazenar um número e uma string ao mesmo tempo como uma chave ou valor.

source: Objects in AutoHotkey support the following basic messages:
pt_br: Objetos no AutoHotkey suportam as mensagens básicas a seguir:

source: Objects work through the principle of message passing.
pt_br: Objetos funcionam de acordo com o princípio da troca de mensagens.

source: Of course, you can always open your text editor first and then open the script as you would any other text file.
pt_br: Evidentemente, você sempre pode abrir seu editor de texto primeiro e aí abrir o script como você faria com qualquer outro arquivo de texto.

source: On Windows 7 and later, taskbar buttons for multiple scripts are automatically grouped together or combined into one button by default.
pt_br: No Windows 7 e posteriores, os botões da barra de tarefas para múltiplos scripts são automaticamente agrupados ou combinados em um único botão, por padrão.

source: On a related note, the contents of the address bar and status bar can be retrieved as demonstrated at www.autohotkey.com/forum/topic19255.html.
pt_br: Observação relacionada: o conteúdo da barra de endereços e da barra de status podem ser obtidos como demonstrado em www.autohotkey.com/forum/topic19255.html.

source: On some systems you may need to enclose the name in quotes to ensure the editor does not add another extension (such as .txt).
pt_br: Em alguns sistemas você pode precisar envolver o nome em aspas para garantir que o editor não adicione outra extensão (como .txt).

source: On the ControlGetText page you will see this:
pt_br: Na página do comando ControlGetText você verá isto:

source: On the left side of traditional (non-expression) if-statements:
pt_br: No lado esquerdo das instruções com if tradicionais (que não sejam expressões):

source: On the left side of an assignment:
pt_br: No lado esquerdo da atribuição de valor:

source: On the left side of legacy (non-expression) if-statements:
pt_br: No lado esquerdo de instruções com If que usarem a sintaxe legada, ou seja, que não seja uma expressão:

source: Once done, great!
pt_br: Feito isso, ótimo!

source: Once it is enabled, launch your script file by right-clicking it and selecting Run with UI Access, or use a command line like "AutoHotkeyU32_UIA.exe" "Your script.ahk" (but include full paths).
pt_br: Uma vez habilitada a opção, execute seu arquivo de script clicando com o botão direito nele e selecione Run with UI Access, ou use uma linha de comando como "AutoHotkeyU32_UIA.exe" "Seu script.ahk" (mas inclua caminhos completos).

source: Once you have AutoHotkey installed, you will probably want it to do stuff.
pt_br: Instalado o AutoHotkey, você agora quer que ele faça coisas para você.

source: One common suggestion is to upload the file to an online service such as virustotal or Jotti and see what other antivirus programs have to say.
pt_br: Uma sugestão comum é enviar o arquivo para um serviço online como virustotal ou Jotti e ver o que outros programas antivírus têm a dizer.

source: One of AutoHotkey's strengths is the ease with which scripts can automate other programs and perform many other common tasks by simply calling a few functions.
pt_br: Uma das vantagens do AutoHotkey é a facilidade com que os scripts podem automatizar outros programas e realizar várias outras tarefas comuns simplesmente chamando algumas funções.

source: One of the most common issues with AutoHotkey involving variables is when to use the percent signs (%).
pt_br: Um dos problemas mais comuns com o AutoHotkey envolvendo variáveis é quando usar sinais de porcentagem (%).

source: One strategy for dealing with this is to avoid direct comparison, instead comparing the difference.
pt_br: Uma estratégia para lidar com isso é evitar a comparação direta, e fazer a comparação da diferença no lugar.

source: Open - Open the script's main window.
pt_br: Open - Abre a janela principal do script.

source: Open Notepad
pt_br: Abrir o Bloco de Notas

source: Open it.
pt_br: Abra-o.

source: Open notepad or (anything you can type in) and press Ctrl and J.
pt_br: Abra o Bloco de Notas ou (qualquer janela em que você possa digitar texto) e pressione Ctrl e J.

source: Or add in some more details:
pt_br: Ou adicionar mais alguns detalhes:

source: Or look for "AutoHotkey Help File" or "AutoHotkey.chm" in the start menu or your installation directory.
pt_br: Ou procure pelo arquivo “AutoHotkey Help File” ou “AutoHotkey.chm” no menu iniciar ou no diretório de instalação do programa.

source: Other Examples?
pt_br: Outros exemplos?

source: Other Helpful Goodies
pt_br: Outras utilidades

source: Other Keys
pt_br: Outras Teclas

source: Other links
pt_br: Outros links

source: Other:
pt_br: Outros:

source: Otherwise, the default is Unicode 32-bit or Unicode 64-bit depending on whether the OS is 64-bit.
pt_br: Do contrário, a versão padrão é a Unicode 32 bits ou Unicode 64 bits, dependendo de o sistema operacional ser ou não 64 bits.

source: Otherwise:
pt_br: Do contrário:

source: Output := SubStr("I'm scripting, awesome!", 16)
pt_br: Output := SubStr("Estou escrevendo código, maravilha!", 16)

source: Parameters
pt_br: Parâmetros

source: Parameters are passed to a function or command, meaning that a value is specified for each parameter of the function or command when it is called.
pt_br: Parâmetros são passados para uma função ou comando, o que significa que um valor é especificado para cada parâmetro da função ou comando quando ele(a) é chamado.

source: Parameters can also be called arguments.
pt_br: Parâmetros também podem ser chamados de argumentos.

source: Pass parameters
pt_br: Passagem de parâmetros

source: Pass the /R switch to automatically reload these scripts using whichever EXE they were running on, without command line args.
pt_br: Passe o switch /R para automaticamente recarregar esses scripts usando qualquer que seja o EXE que os estava executando, sem argumentos da linha de comando.

source: Passing this reference to a function or storing it in a variable or another object creates a new reference to the same object.
pt_br: Passar essa referência a uma função ou armazená-la numa variável ou outro objeto cria uma nova referência ao mesmo objeto.

source: Pause Script - Pause or unpause the script.
pt_br: Pause Script - Pausa ou despausa o script.

source: People usually use 3 or 4 spaces or 1 tab per "level".
pt_br: As pessoas normalmente usam 3 ou 4 espaços ou 1 tab por “nível”.

source: Percent signs can also have other meanings:
pt_br: Sinais de porcentagem também podem ter outros significados:

source: Permission denied.
pt_br: Permissão negada.

source: Play/Pause
pt_br: Tocar / Pausar

source: Please note that you cannot IGNORE parameters, but you can leave them blank.
pt_br: Por favor note que você não pode IGNORAR os parâmetros, mas você pode deixá-los em branco.

source: Please pay attention to the equal sign (=).
pt_br: Por favor preste atenção ao sinal de igualdade =.

source: Pop method
pt_br: Método Pop

source: Portability of AutoHotkey.exe
pt_br: Portabilidade do AutoHotkey.exe

source: Post anything you have tried.
pt_br: Poste qualquer coisa que você tenta tentado.

source: PostMessage, 0x0111, 65303,,, ScriptFileName.ahk - AutoHotkey
pt_br: PostMessage, 0x0111, 65303,,, NomeDoArquivoDoScript.ahk - AutoHotkey

source: PostMessage, 0x0111, 65305,,, ScriptFileName.ahk - AutoHotkey
pt_br: PostMessage, 0x0111, 65305,,, NomeDoArquivoDoScript.ahk - AutoHotkey

source: PostMessage, 0x0111, 65306,,, ScriptFileName.ahk - AutoHotkey
pt_br: PostMessage, 0x0111, 65306,,, NomeDoArquivoDoScript.ahk - AutoHotkey

source: Press
pt_br: Pressione

source: Press Win+R to open the Run dialog, then enter shell:startup and click OK or Enter.
pt_br: Pressione Win+R para abrir a janela Executar, daí digite shell:startup e clique OK ou Enter.

source: Press one of the "mystery keys" on your keyboard.
pt_br: Pressione uma das “teclas misteriosas” em seu teclado.

source: Pressing the same hotkey again will stop it.
pt_br: Pressionar a mesma hotkey de novo vai pará-lo.

source: Pretend everyone but you is a doorknob and knows nothing.
pt_br: Finja que todos menos você são “plantas”, que não sabem de nada.

source: Previous Track
pt_br: Faixa anterior

source: Probably C:\ drive.
pt_br: Provavelmente o drive C:\.

source: Property names in classes have the same rules and restrictions as variable names, except that the three characters listed above (# @ $) are not allowed.
pt_br: Nomes de propriedades em classes têm as mesmas regras e restrições dos nomes de variáveis, exceto que os três caracteres listados acima (# @ $) não são permitidos.

source: Provides a string consisting of zero or more of the following letters to indicate the joystick's capabilities:
pt_br: fornece uma string que consiste em zero ou mais das letras a seguir para indicar as funcionalidades do joystick:

source: Pure Numbers
pt_br: Números Puros

source: Push method
pt_br: Método “Push”

source: Quick Reference
pt_br: Referência Rápida

source: Quick Reference | AutoHotkey
pt_br: Referência rápida | AutoHotkey

source: Quick Reference","misc/RegEx-QuickRef.htm"],
pt_br: Referência Rápida","misc/RegEx-QuickRef.htm"],

source: RControl (or RCtrl)
pt_br: RControl (ou RCtrl)

source: Rajat created this script.
pt_br: Rajat criou este script.

source: Raw mode
pt_br: Modo bruto (Raw)

source: Recognizes unusual keys not mentioned above.
pt_br: Reconhece as teclas incomuns não mencionadas acima.

source: Reconfigure the software that came with your mouse or keyboard (sometimes accessible in the Control Panel or Start Menu) to have the "mystery key" send some other keystroke.
pt_br: Reconfigure o software que veio com o seu mouse ou teclado (às vezes acessível no Painel de Controle ou Menu Iniciar) para fazer com a que a “tecla misteriosa” envie o pressionamento de alguma outra tecla.

source: Redirecting to docs/AutoHotkey.htm.
pt_br: Redirecionando para docs/AutoHotkey.htm.

source: References to Objects
pt_br: Referências a Objetos

source: Refresh
pt_br: Atualizar

source: RegEx quick reference
pt_br: Expressões regulares — referência rápida

source: Regardless of the particular mouse, Send and Click can be used to scroll horizontally in programs which support it.
pt_br: Independentemente do mouse em particular, Send e Click podem ser usados para rolar horizontalmente em programas que suportam rolagem horizontal.

source: Registers the context menu option to run the appropriate exe file.
pt_br: Registra a opção do menu contexto para executar o executável apropriado.

source: Related
pt_br: Tópicos relacionados

source: Related:
pt_br: Assuntos relacionados:

source: Release
pt_br: Solte

source: Reload This Script - See Reload.
pt_br: Reload This Script - Veja Reload (recarregar).

source: Remapping keys and buttons
pt_br: Remapeamento de teclas e botões

source: RemoveAt method
pt_br: Método RemoveAt

source: RemovedValue := MyObject.Delete(AnyKey)
pt_br: ValorDeletado := MeuObjeto.Delete(QualquerChave)

source: RemovedValue := MyObject.RemoveAt(Index)
pt_br: ValorRemovido := MeuObjeto.RemoveAt(Indice)

source: Requires Windows Vista or later.
pt_br: Requer Windows Vista ou posterior.

source: Respond to signals from hand-held remote controls via the WinLIRC client script.
pt_br: Responda a sinais de controles remotos de mão por meio do script do cliente WinLIRC.

source: Return a value
pt_br: Retornar um valor

source: Reusable code saves time, by avoiding the need to write and test code for the same or similar tasks over and over.
pt_br: Código reusável poupa tempo, dispensando a necessidade de escrever e testar código para a mesma tarefa ou tarefas similares a cada vez.

source: Right Alt (or AltGr, depending on keyboard layout)
pt_br: Tecla Alt da direita (ou AltGr, dependendo do layout do teclado)

source: Right Alt.
pt_br: Tecla Alt da direita.

source: Right Ctrl
pt_br: Tecla Ctrl da direita

source: Right Ctrl.
pt_br: Tecla Ctrl da direita.

source: Right Shift.
pt_br: Tecla Shift da direita.

source: Right Win.
pt_br: Tecla Win da direita.

source: Right click inside the window, and click "Paste Shortcut".
pt_br: Clique com o botão direito dentro da janela e clique em "Colar atalho".

source: Right-Click on your desktop.
pt_br: Clique com o botão direito na sua área de trabalho.
